AT_Demo/API/Result2/Report/Data/Step1.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_c1d4b478-5361-4919-97f1-a30ea2d3bf8a.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;Body&gt;
    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;FlightOrder&gt;
        &lt;Class&gt;First&lt;/Class&gt;
        &lt;CustomerName&gt;MD S IMRAN&lt;/CustomerName&gt;
        &lt;DepartureDate&gt;2024-12-21T00:00:00&lt;/DepartureDate&gt;
        &lt;FlightNumber&gt;20279&lt;/FlightNumber&gt;
        &lt;NumberOfTickets&gt;3&lt;/NumberOfTickets&gt;
      &lt;/FlightOrder&gt;
    &lt;/CreateFlightOrder&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">HPFlights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">CreateFlightOrder</Operation><Address name="Address">http://localhost:24240/HPFlights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IHPFlights_Service/CreateFlightOrder</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IHPFlights_Service/CreateFlightOrder
Content-Type:	text/xml; charset=utf-8
Host:	localhost:24240
</InputHeader><VTD_Message name="Message">Unable to connect to the remote server</VTD_Message><Name name="Name">'CreateFlightOrder'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Failure</VTD_Status><VTD_Details name="Details">CreateFlightOrder ended unsuccessfully</VTD_Details></report>