FI/01_Test_Scripts/DriverScript/Res4/StRes1/Report/Data/Step6.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">UpdateFlightOrder</td><td class="value col-head-style">StServiceCallActivity10</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity10_InputXml_09bd2a27-f3e4-4e15-8dd0-f87979577a6b.xml\', \'Data/StServiceCallActivity10_InputXml_09bd2a27-f3e4-4e15-8dd0-f87979577a6b.js4hrpt\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;UpdateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;UpdateFlightOrderDetails&gt;\r\n        &lt;Class&gt;Economy&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Christopher&lt;/CustomerName&gt;\r\n        &lt;NumberOfTickets&gt;2&lt;/NumberOfTickets&gt;\r\n        &lt;OrderNumber&gt;171&lt;/OrderNumber&gt;\r\n      &lt;/UpdateFlightOrderDetails&gt;\r\n    &lt;/UpdateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">UpdateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/UpdateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity10_Full_request_d28a43bf-5f79-4171-b1c0-3c7b039a4424.xml\', \'Data/StServiceCallActivity10_Full_request_d28a43bf-5f79-4171-b1c0-3c7b039a4424.js4hrpt\', \'.xml\', \'Full request\');return false;">&lt;Envelope xmlns="htt ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/UpdateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	383\nExpect:	100-continue\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	230\nContent-Type:	text/xml; charset=utf-8\nDate:	Tue, 09 Jun 2020 09:09:12 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;UpdateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;UpdateFlightOrderResult&gt;true&lt;/UpdateFlightOrderResult&gt;&lt;/UpdateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity10_OutputXml_2ae10884-346c-41ed-88f6-0bdb777f6907.xml\', \'Data/StServiceCallActivity10_OutputXml_2ae10884-346c-41ed-88f6-0bdb777f6907.js4hrpt\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;UpdateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;UpdateFlightOrderResult&gt;true&lt;/UpdateFlightOrderResult&gt;\r\n    &lt;/UpdateFlightOrderResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}